In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import pandas as pd  
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
database_name = 'scooters'    # Fill this in with your lahman database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [4]:
query = '''
SELECT *
FROM scooters
LIMIT 100
'''
with engine.connect() as connection:
    result = connection.execute(text(query))

In [5]:
with engine.connect() as connection:
    scooters = pd.read_sql(text(query), con = connection)
scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-06-07 11:29:13.853,36.183359,-86.794944,PoweredIT4OCGTJ5PMGY,Powered,53.0,scooter,0.15,Lime
1,2019-06-07 11:29:13.853,36.180150,-86.792368,PoweredSWMT4H47PULQM,Powered,48.0,scooter,0.15,Lime
2,2019-06-07 11:29:13.853,36.172215,-86.792436,PoweredWBISDU2VS5I4T,Powered,55.0,scooter,0.15,Lime
3,2019-06-07 11:29:13.853,36.179883,-86.793031,PoweredCFP6MH5XYRIN4,Powered,44.0,scooter,0.15,Lime
4,2019-06-07 11:29:13.853,36.179913,-86.793021,PoweredAL5KY2EYSKSKH,Powered,46.0,scooter,0.15,Lime

In [6]:
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  100 non-null    datetime64[ns]
 1   latitude     100 non-null    float64
 2   longitude    100 non-null    float64
 3   sumdid       100 non-null    object
 4   sumdtype     100 non-null    object
 5   chargelevel  100 non-null    float64
 6   sumdgroup    100 non-null    object
 7   costpermin   100 non-null    float64
 8   companyname  100 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 7.2+ KB

In [7]:
query = '''
SELECT companyname, Count(*)
FROM scooters 
group by companyname;
'''
counts = pd.read_sql_query(query, engine)
counts

  companyname     count
0        Bird  12251590
1        Bolt   3477198
2      Gotcha   4679280
3        Jump  21835098
4        Lime  16524261
5        Lyft   9087043
6        Spin   5559573

In [8]:
TRIP = '''
SELECT *
FROM TRIPS 
LIMIT 100
'''
TRIPSVAL = pd.read_sql_query(TRIP, engine)
TRIPSVAL.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [9]:
SUMIDS = '''
SELECT SUMDID
FROM trips
GROUP BY SUMDID
ORDER BY SUMDID
'''
SUMIDSTRIP = pd.read_sql_query(SUMIDS, engine)
SUMIDSTRIP

                                            sumdid
0     Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619
1     Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d
2     Powered-03be23ca-d43b-222f-be54-e44b5b4690df
3     Powered-046201fb-6532-1f37-6334-3612fb1e61f7
4     Powered-0479bb84-afbd-0426-f1c4-df628542a88c
...                                            ...
9000                                  PoweredZZFGD
9001                          PoweredZZNTWU4QI7MLI
9002                          PoweredZZQ7FMUUD6ULV
9003                          PoweredZZQOO54WD4AJT
9004                         StandardLIRPOZ7X3ZVGO

[9005 rows x 1 columns]

In [10]:
MINLATLON = '''
SELECT 'SCOOTER'TABLE_NAME,MIN(latitude) MIN_LAT,MAX(latitude) MAX_LAT,MIN(longitude) MIN_LON, MAX(longitude) MAX_LON 
FROM scooters 
UNION 
SELECT 'TRIPS'TABLE_NAME, MIN(startlatitude) MIN_LAT,MAX(endlatitude) MAX_LAT,MIN(endlongitude) MIN_LON, MAX(endlongitude) MAX_LON 
FROM trips 
'''
LATLON = pd.read_sql_query(MINLATLON, engine)
LATLON

  table_name  min_lat       max_lat     min_lon     max_lon
0    SCOOTER   0.0000  3.609874e+06  -97.443879    0.000000
1      TRIPS  35.8532  5.104541e+01 -122.673729  174.764886

In [11]:
SUMGRP ='''
SELECT SUMDGROUP
FROM scooters 
GROUP BY SUMDGROUP
'''

GROUPTYPE = pd.read_sql_query(SUMGRP, engine)
GROUPTYPE

  sumdgroup
0   bicycle
1   scooter
2   Scooter

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

1A. How many scooters did each company have in this time frame

In [ ]:
TOTALSCOOTERS = '''
SELECT COMPANYNAME,
COUNT(DISTINCT(SUMDID)) COUNTS
FROM scooters
WHERE UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
COMPANYNAME
'''
SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)
SCOOTERCOUNT

In [ ]:
1B. Did the number for each company change over time?

In [ ]:
JUSTSCOOTERS1 = '''
SELECT 
UPPER(SUMDGROUP) SUMDGROUP,
UPPER(COMPANYNAME) COMPANYNAME,
TO_CHAR(PUBDATETIME,'MM') MONTH_NUM,
TO_CHAR(PUBDATETIME,'MONTH') MONTH_NAME,
TO_CHAR(PUBDATETIME,'YYYY') YEAR_VAL,
COUNT(DISTINCT(SUMDID))
FROM SCOOTERS 
WHERE 
UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
ORDER BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
'''

SCOOTERSONLY1 = pd.read_sql_query(JUSTSCOOTERS1 , con = engine)
SCOOTERSONLY1

1C. Did scooter usage vary by company?